Revit 2024 API
NetworkCommunicationException Class
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class NetworkCommunicationException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class NetworkCommunicationException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class NetworkCommunicationException : public ApplicationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.NetworkCommunicationException
See Also
NetworkCommunicationException Members
Autodesk.Revit.Exceptions Namespace